## Terraform Plan for Azure Sentinel KQL Testing Infrastructure
    
    <details>
    <summary>Show Plan</summary>
    
    ```terraform
    data.azuread_client_config.current: Reading...
data.azuread_client_config.current: Read complete after 0s [id=2a48a90a-6fb7-4be7-8bd5-8de7bcc0feaa-b4c37715-38ec-4bd8-9814-136dea9bea08-b1ccd6e4-3e9d-4485-b74b-084410d5a70a]
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iNGMzNzcxNS0zOGVjLTRiZDgtOTgxNC0xMzZkZWE5YmVhMDg7b2JqZWN0SWQ9YjFjY2Q2ZTQtM2U5ZC00NDg1LWI3NGItMDg0NDEwZDVhNzBhO3N1YnNjcmlwdGlvbklkPTdkMTY0YjAxLTBhMDctNDI1NS05Njc1LTZjNTA3YjVkMjU4Mzt0ZW5hbnRJZD0yYTQ4YTkwYS02ZmI3LTRiZTctOGJkNS04ZGU3YmNjMGZlYWE=]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_advanced_threat_protection.storage[0] will be created
  + resource "azurerm_advanced_threat_protection" "storage" {
      + enabled            = true
      + id                 = (known after apply)
      + target_resource_id = (known after apply)
    }

  # azurerm_dev_test_global_vm_shutdown_schedule.test[0] will be created
  + resource "azurerm_dev_test_global_vm_shutdown_schedule" "test" {
      + daily_recurrence_time = "1900"
      + enabled               = true
      + id                    = (known after apply)
      + location              = "eastus"
      + tags                  = {
          + "CreatedBy"   = "Terraform"
          + "Environment" = "dev"
          + "Project"     = "Sentinel-KQL-Testing"
          + "Purpose"     = "KQL-Query-Testing"
        }
      + timezone              = "UTC"
      + virtual_machine_id    = (known after apply)

      + notification_settings {
          + enabled         = false
          + time_in_minutes = 30
        }
    }

  # azurerm_key_vault.main[0] will be created
  + resource "azurerm_key_vault" "main" {
      + access_policy                 = [
          + {
              + certificate_permissions = [
                  + "Get",
                  + "List",
                  + "Create",
                  + "Delete",
                  + "Update",
                  + "Recover",
                  + "Purge",
                ]
              + key_permissions         = [
                  + "Get",
                  + "List",
                  + "Create",
                  + "Delete",
                  + "Update",
                  + "Recover",
                  + "Purge",
                ]
              + object_id               = "b1ccd6e4-3e9d-4485-b74b-084410d5a70a"
              + secret_permissions      = [
                  + "Get",
                  + "List",
                  + "Set",
                  + "Delete",
                  + "Recover",
                  + "Purge",
                ]
              + tenant_id               = "2a48a90a-6fb7-4be7-8bd5-8de7bcc0feaa"
            },
        ]
      + enabled_for_disk_encryption   = true
      + id                            = (known after apply)
      + location                      = "eastus"
      + name                          = (known after apply)
      + public_network_access_enabled = true
      + purge_protection_enabled      = false
      + resource_group_name           = "sentinel-kql-dev-dev-rg"
      + sku_name                      = "standard"
      + soft_delete_retention_days    = 7
      + tags                          = {
          + "CreatedBy"   = "Terraform"
          + "Environment" = "dev"
          + "Project"     = "Sentinel-KQL-Testing"
          + "Purpose"     = "KQL-Query-Testing"
        }
      + tenant_id                     = "2a48a90a-6fb7-4be7-8bd5-8de7bcc0feaa"
      + vault_uri                     = (known after apply)
    }

  # azurerm_key_vault_secret.test_secret[0] will be created
  + resource "azurerm_key_vault_secret" "test_secret" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "test-secret"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "CreatedBy"   = "Terraform"
          + "Environment" = "dev"
          + "Project"     = "Sentinel-KQL-Testing"
          + "Purpose"     = "KQL-Query-Testing"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_log_analytics_workspace.main will be created
  + resource "azurerm_log_analytics_workspace" "main" {
      + allow_resource_only_permissions = true
      + daily_quota_gb                  = 10
      + id                              = (known after apply)
      + internet_ingestion_enabled      = true
      + internet_query_enabled          = true
      + local_authentication_disabled   = false
      + location                        = "eastus"
      + name                            = (known after apply)
      + primary_shared_key              = (sensitive value)
      + resource_group_name             = "sentinel-kql-dev-dev-rg"
      + retention_in_days               = 30
      + secondary_shared_key            = (sensitive value)
      + sku                             = "PerGB2018"
      + tags                            = {
          + "CreatedBy"   = "Terraform"
          + "Environment" = "dev"
          + "Project"     = "Sentinel-KQL-Testing"
          + "Purpose"     = "KQL-Query-Testing"
        }
      + workspace_id                    = (known after apply)
    }

  # azurerm_monitor_diagnostic_setting.keyvault[0] will be created
  + resource "azurerm_monitor_diagnostic_setting" "keyvault" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = (known after apply)
      + name                           = "sentinel-kql-dev-dev-kv-diagnostics"
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category = "AuditEvent"
        }
      + enabled_log {
          + category = "AzurePolicyEvaluationDetails"
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = true
        }
    }

  # azurerm_monitor_diagnostic_setting.nsg will be created
  + resource "azurerm_monitor_diagnostic_setting" "nsg" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = (known after apply)
      + name                           = "sentinel-kql-dev-dev-nsg-diagnostics"
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category = "NetworkSecurityGroupEvent"
        }
      + enabled_log {
          + category = "NetworkSecurityGroupRuleCounter"
        }
    }

  # azurerm_network_interface.test_vm[0] will be created
  + resource "azurerm_network_interface" "test_vm" {
      + accelerated_networking_enabled = (known after apply)
      + applied_dns_servers            = (known after apply)
      + dns_servers                    = (known after apply)
      + enable_accelerated_networking  = (known after apply)
      + enable_ip_forwarding           = (known after apply)
      + id                             = (known after apply)
      + internal_domain_name_suffix    = (known after apply)
      + ip_forwarding_enabled          = (known after apply)
      + location                       = "eastus"
      + mac_address                    = (known after apply)
      + name                           = "sentinel-kql-dev-dev-vm-nic"
      + private_ip_address             = (known after apply)
      + private_ip_addresses           = (known after apply)
      + resource_group_name            = "sentinel-kql-dev-dev-rg"
      + tags                           = {
          + "CreatedBy"   = "Terraform"
          + "Environment" = "dev"
          + "Project"     = "Sentinel-KQL-Testing"
          + "Purpose"     = "KQL-Query-Testing"
        }
      + virtual_machine_id             = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "internal"
          + primary                                            = (known after apply)
          + private_ip_address                                 = (known after apply)
          + private_ip_address_allocation                      = "Dynamic"
          + private_ip_address_version                         = "IPv4"
          + public_ip_address_id                               = (known after apply)
          + subnet_id                                          = (known after apply)
        }
    }

  # azurerm_network_security_group.test will be created
  + resource "azurerm_network_security_group" "test" {
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "sentinel-kql-dev-dev-nsg"
      + resource_group_name = "sentinel-kql-dev-dev-rg"
      + security_rule       = [
          + {
              + access                                     = "Allow"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "22"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "AllowSSHFromInternet"
              + priority                                   = 100
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Allow"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "3389"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "AllowRDPFromInternet"
              + priority                                   = 110
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
        ]
      + tags                = {
          + "CreatedBy"   = "Terraform"
          + "Environment" = "dev"
          + "Project"     = "Sentinel-KQL-Testing"
          + "Purpose"     = "KQL-Query-Testing"
        }
    }

  # azurerm_network_watcher.main will be created
  + resource "azurerm_network_watcher" "main" {
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "sentinel-kql-dev-dev-nw"
      + resource_group_name = "sentinel-kql-dev-dev-rg"
      + tags                = {
          + "CreatedBy"   = "Terraform"
          + "Environment" = "dev"
          + "Project"     = "Sentinel-KQL-Testing"
          + "Purpose"     = "KQL-Query-Testing"
        }
    }

  # azurerm_public_ip.test_vm[0] will be created
  + resource "azurerm_public_ip" "test_vm" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "eastus"
      + name                    = "sentinel-kql-dev-dev-vm-pip"
      + resource_group_name     = "sentinel-kql-dev-dev-rg"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
      + tags                    = {
          + "CreatedBy"   = "Terraform"
          + "Environment" = "dev"
          + "Project"     = "Sentinel-KQL-Testing"
          + "Purpose"     = "KQL-Query-Testing"
        }
    }

  # azurerm_resource_group.main will be created
  + resource "azurerm_resource_group" "main" {
      + id       = (known after apply)
      + location = "eastus"
      + name     = "sentinel-kql-dev-dev-rg"
      + tags     = {
          + "CreatedBy"   = "Terraform"
          + "Environment" = "dev"
          + "Project"     = "Sentinel-KQL-Testing"
          + "Purpose"     = "KQL-Query-Testing"
        }
    }

  # azurerm_security_center_auto_provisioning.main[0] will be created
  + resource "azurerm_security_center_auto_provisioning" "main" {
      + auto_provision = "On"
      + id             = (known after apply)
    }

  # azurerm_security_center_workspace.main[0] will be created
  + resource "azurerm_security_center_workspace" "main" {
      + id           = (known after apply)
      + scope        = "/subscriptions/7d164b01-0a07-4255-9675-6c507b5d2583"
      + workspace_id = (known after apply)
    }

  # azurerm_sentinel_alert_rule_scheduled.high_risk_ip[0] will be created
  + resource "azurerm_sentinel_alert_rule_scheduled" "high_risk_ip" {
      + description                = "Detects authentication attempts from known high-risk IP addresses"
      + display_name               = "Activity from High-Risk IP Addresses"
      + enabled                    = true
      + id                         = (known after apply)
      + log_analytics_workspace_id = (known after apply)
      + name                       = "High-Risk IP Activity"
      + query                      = <<-EOT
            let RiskyIPs = externaldata(IPAddress: string)
            [@"https://raw.githubusercontent.com/stamparm/ipsum/master/ipsum.txt"] 
            with (format="txt", ignoreFirstRecord=true)
            | where IPAddress matches regex @"\d+\.\d+\.\d+\.\d+"
            | extend IPAddress = trim_start(@"[0-9]+\s+", IPAddress)
            | distinct IPAddress;
            SigninLogs
            | where TimeGenerated > ago(1d)
            | where IPAddress in (RiskyIPs)
            | project TimeGenerated, UserPrincipalName, IPAddress, Location, AppDisplayName, ResultType
        EOT
      + query_frequency            = "PT6H"
      + query_period               = "P1D"
      + severity                   = "Medium"
      + suppression_duration       = "PT5H"
      + suppression_enabled        = false
      + tactics                    = [
          + "InitialAccess",
          + "Persistence",
        ]
      + trigger_operator           = "GreaterThan"
      + trigger_threshold          = 1
    }

  # azurerm_sentinel_alert_rule_scheduled.keyvault_anomalies[0] will be created
  + resource "azurerm_sentinel_alert_rule_scheduled" "keyvault_anomalies" {
      + description                = "Detects unusual access patterns to Key Vault secrets and keys"
      + display_name               = "Unusual Key Vault Access Patterns"
      + enabled                    = true
      + id                         = (known after apply)
      + log_analytics_workspace_id = (known after apply)
      + name                       = "Key Vault Access Anomalies"
      + query                      = <<-EOT
            KeyVaultDiagnostics
            | where TimeGenerated > ago(7d)
            | where OperationName == "SecretGet" or OperationName == "KeyGet"
            | summarize AccessCount = count() by CallerIPAddress, bin(TimeGenerated, 1h)
            | summarize avg(AccessCount), max(AccessCount), count() by CallerIPAddress
            | where max_AccessCount > (avg_AccessCount * 3) and count_ > 24  // Anomalous access pattern
            | project CallerIPAddress, AverageAccess = avg_AccessCount, MaxAccess = max_AccessCount, Hours = count_
        EOT
      + query_frequency            = "PT4H"
      + query_period               = "P7D"
      + severity                   = "Medium"
      + suppression_duration       = "PT5H"
      + suppression_enabled        = false
      + tactics                    = [
          + "Collection",
          + "CredentialAccess",
        ]
      + trigger_operator           = "GreaterThan"
      + trigger_threshold          = 1
    }

  # azurerm_sentinel_alert_rule_scheduled.suspicious_signin[0] will be created
  + resource "azurerm_sentinel_alert_rule_scheduled" "suspicious_signin" {
      + description                = "Detects suspicious sign-in activities with multiple failed attempts from external IPs"
      + display_name               = "Suspicious Sign-in Activity Detection"
      + enabled                    = true
      + id                         = (known after apply)
      + log_analytics_workspace_id = (known after apply)
      + name                       = "Suspicious Sign-in Activity"
      + query                      = <<-EOT
            SigninLogs
            | where TimeGenerated > ago(1h)
            | where ResultType != 0  // Failed sign-ins
            | where IPAddress !startswith "10." and IPAddress !startswith "192.168." and IPAddress !startswith "172."
            | summarize FailedAttempts = count(), Countries = make_set(LocationDetails.countryOrRegion), IPs = make_set(IPAddress) by UserPrincipalName
            | where FailedAttempts >= 5
            | project UserPrincipalName, FailedAttempts, Countries, IPs
        EOT
      + query_frequency            = "PT1H"
      + query_period               = "PT1H"
      + severity                   = "High"
      + suppression_duration       = "PT5H"
      + suppression_enabled        = false
      + tactics                    = [
          + "CredentialAccess",
          + "InitialAccess",
        ]
      + trigger_operator           = "GreaterThan"
      + trigger_threshold          = 1
    }

  # azurerm_sentinel_data_connector_azure_active_directory.main[0] will be created
  + resource "azurerm_sentinel_data_connector_azure_active_directory" "main" {
      + id                         = (known after apply)
      + log_analytics_workspace_id = (known after apply)
      + name                       = "AzureActiveDirectory"
      + tenant_id                  = (known after apply)
    }

  # azurerm_sentinel_data_connector_azure_security_center.main[0] will be created
  + resource "azurerm_sentinel_data_connector_azure_security_center" "main" {
      + id                         = (known after apply)
      + log_analytics_workspace_id = (known after apply)
      + name                       = "AzureSecurityCenter"
      + subscription_id            = (known after apply)
    }

  # azurerm_sentinel_data_connector_office_365.main[0] will be created
  + resource "azurerm_sentinel_data_connector_office_365" "main" {
      + exchange_enabled           = true
      + id                         = (known after apply)
      + log_analytics_workspace_id = (known after apply)
      + name                       = "Office365"
      + sharepoint_enabled         = true
      + teams_enabled              = true
      + tenant_id                  = (known after apply)
    }

  # azurerm_sentinel_log_analytics_workspace_onboarding.main[0] will be created
  + resource "azurerm_sentinel_log_analytics_workspace_onboarding" "main" {
      + customer_managed_key_enabled = false
      + id                           = (known after apply)
      + resource_group_name          = (known after apply)
      + workspace_id                 = (known after apply)
      + workspace_name               = (known after apply)
    }

  # azurerm_sentinel_watchlist.known_good_ips[0] will be created
  + resource "azurerm_sentinel_watchlist" "known_good_ips" {
      + default_duration           = "P30D"
      + description                = "List of trusted IP addresses for exclusion from alerts"
      + display_name               = "Known Good IP Addresses"
      + id                         = (known after apply)
      + item_search_key            = "IPAddress"
      + labels                     = [
          + "IP",
          + "TrustedSource",
        ]
      + log_analytics_workspace_id = (known after apply)
      + name                       = "KnownGoodIPs"
    }

  # azurerm_storage_account.logs will be created
  + resource "azurerm_storage_account" "logs" {
      + access_tier                        = (known after apply)
      + account_kind                       = "StorageV2"
      + account_replication_type           = "LRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = true
      + cross_tenant_replication_enabled   = true
      + default_to_oauth_authentication    = false
      + dns_endpoint_type                  = "Standard"
      + enable_https_traffic_only          = (known after apply)
      + https_traffic_only_enabled         = true
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = true
      + location                           = "eastus"
      + min_tls_version                    = "TLS1_2"
      + name                               = (known after apply)
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = true
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "sentinel-kql-dev-dev-rg"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = true
      + table_encryption_key_type          = "Service"
      + tags                               = {
          + "CreatedBy"   = "Terraform"
          + "Environment" = "dev"
          + "Project"     = "Sentinel-KQL-Testing"
          + "Purpose"     = "KQL-Query-Testing"
        }
    }

  # azurerm_subnet.default will be created
  + resource "azurerm_subnet" "default" {
      + address_prefixes                               = [
          + "10.0.1.0/24",
        ]
      + default_outbound_access_enabled                = true
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "default"
      + private_endpoint_network_policies              = (known after apply)
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "sentinel-kql-dev-dev-rg"
      + virtual_network_name                           = "sentinel-kql-dev-dev-vnet"
    }

  # azurerm_subnet.security will be created
  + resource "azurerm_subnet" "security" {
      + address_prefixes                               = [
          + "10.0.2.0/24",
        ]
      + default_outbound_access_enabled                = true
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "security"
      + private_endpoint_network_policies              = (known after apply)
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "sentinel-kql-dev-dev-rg"
      + virtual_network_name                           = "sentinel-kql-dev-dev-vnet"
    }

  # azurerm_subnet_network_security_group_association.default will be created
  + resource "azurerm_subnet_network_security_group_association" "default" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # azurerm_virtual_machine_extension.mma[0] will be created
  + resource "azurerm_virtual_machine_extension" "mma" {
      + auto_upgrade_minor_version  = true
      + failure_suppression_enabled = false
      + id                          = (known after apply)
      + name                        = "MicrosoftMonitoringAgent"
      + protected_settings          = (sensitive value)
      + publisher                   = "Microsoft.EnterpriseCloud.Monitoring"
      + settings                    = (known after apply)
      + tags                        = {
          + "CreatedBy"   = "Terraform"
          + "Environment" = "dev"
          + "Project"     = "Sentinel-KQL-Testing"
          + "Purpose"     = "KQL-Query-Testing"
        }
      + type                        = "MicrosoftMonitoringAgent"
      + type_handler_version        = "1.0"
      + virtual_machine_id          = (known after apply)
    }

  # azurerm_virtual_network.main will be created
  + resource "azurerm_virtual_network" "main" {
      + address_space       = [
          + "10.0.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "sentinel-kql-dev-dev-vnet"
      + resource_group_name = "sentinel-kql-dev-dev-rg"
      + subnet              = (known after apply)
      + tags                = {
          + "CreatedBy"   = "Terraform"
          + "Environment" = "dev"
          + "Project"     = "Sentinel-KQL-Testing"
          + "Purpose"     = "KQL-Query-Testing"
        }
    }

  # azurerm_windows_virtual_machine.test[0] will be created
  + resource "azurerm_windows_virtual_machine" "test" {
      + admin_password                                         = (sensitive value)
      + admin_username                                         = "azureuser"
      + allow_extension_operations                             = true
      + bypass_platform_safety_checks_on_user_schedule_enabled = false
      + computer_name                                          = (known after apply)
      + disk_controller_type                                   = (known after apply)
      + enable_automatic_updates                               = true
      + extensions_time_budget                                 = "PT1H30M"
      + hotpatching_enabled                                    = false
      + id                                                     = (known after apply)
      + location                                               = "eastus"
      + max_bid_price                                          = -1
      + name                                                   = "sentinel-kql-dev-dev-testvm"
      + network_interface_ids                                  = (known after apply)
      + patch_assessment_mode                                  = "ImageDefault"
      + patch_mode                                             = "AutomaticByOS"
      + platform_fault_domain                                  = -1
      + priority                                               = "Regular"
      + private_ip_address                                     = (known after apply)
      + private_ip_addresses                                   = (known after apply)
      + provision_vm_agent                                     = true
      + public_ip_address                                      = (known after apply)
      + public_ip_addresses                                    = (known after apply)
      + resource_group_name                                    = "sentinel-kql-dev-dev-rg"
      + size                                                   = "Standard_B2s"
      + tags                                                   = {
          + "CreatedBy"   = "Terraform"
          + "Environment" = "dev"
          + "Project"     = "Sentinel-KQL-Testing"
          + "Purpose"     = "KQL-Query-Testing"
        }
      + virtual_machine_id                                     = (known after apply)
      + vm_agent_platform_updates_enabled                      = false

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = (known after apply)
          + name                      = (known after apply)
          + storage_account_type      = "Premium_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "WindowsServer"
          + publisher = "MicrosoftWindowsServer"
          + sku       = "2022-Datacenter"
          + version   = "latest"
        }
    }

  # random_string.suffix will be created
  + resource "random_string" "suffix" {
      + id          = (known after apply)
      + length      = 8
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

Plan: 30 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + estimated_monthly_cost_usd         = {
      + key_vault                    = "~$1-3 per month"
      + log_analytics_data_ingestion = "~$2-10 per GB ingested"
      + log_analytics_retention      = "~$0.10 per GB per month for retention > 31 days"
      + sentinel                     = "~$2-4 per GB ingested"
      + storage_account              = "~$1-5 per month"
      + test_vm                      = "~$30-50 per month for Standard_B2s"
      + total_estimated              = "$35-75 per month (depending on data volume)"
    }
  + key_vault_name                     = (known after apply)
  + key_vault_uri                      = (known after apply)
  + log_analytics_primary_shared_key   = (sensitive value)
  + log_analytics_query_url            = (known after apply)
  + log_analytics_workspace_id         = (known after apply)
  + log_analytics_workspace_id_value   = (sensitive value)
  + log_analytics_workspace_name       = (known after apply)
  + network_security_group_name        = "sentinel-kql-dev-dev-nsg"
  + resource_group_location            = "eastus"
  + resource_group_name                = "sentinel-kql-dev-dev-rg"
  + sentinel_url                       = (known after apply)
  + sentinel_workspace_connection_info = {
      + location        = "eastus"
      + resource_group  = "sentinel-kql-dev-dev-rg"
      + subscription_id = "7d164b01-0a07-4255-9675-6c507b5d2583"
      + workspace_name  = (known after apply)
    }
  + storage_account_name               = (known after apply)
  + storage_account_primary_access_key = (sensitive value)
  + test_vm_name                       = "sentinel-kql-dev-dev-testvm"
  + test_vm_private_ip                 = (known after apply)
  + test_vm_public_ip                  = (known after apply)
  + virtual_network_id                 = (known after apply)
  + virtual_network_name               = "sentinel-kql-dev-dev-vnet"

Warning: Value for undeclared variable

The root module does not declare a variable named "storage_account_tier" but
a value was found in file "terraform.tfvars". If you meant to use this value,
add a "variable" block to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.

Warning: Value for undeclared variable

The root module does not declare a variable named
"log_analytics_daily_quota_gb" but a value was found in file
"terraform.tfvars". If you meant to use this value, add a "variable" block to
the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.

Warning: Values for undeclared variables

In addition to the other similar warnings shown, 9 other variable(s) defined
without being declared.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

    ```
    </details>
    
    **Environment:** dev
    **Action:** Plan Only